In [1]:
from Repositories.SalesRepository import Repository

In [2]:
salesConnectionString = "Driver={SQL Server};Server=DESKTOP-8INVJ1O\SQLEXPRESS;Database=Sales_db;trusted_connection=yes"
salesRepository = Repository(salesConnectionString)

C:\Users\Max\Documents\GitHub\Scripts\DataHandling\Merging\Repositories\SalesRepository.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  self.salesDataFrame = pd.read_sql("SELECT * FROM Sales", dbConnection)

# Product

In [3]:
productDataFrame = salesRepository.getProductDataFrame()
productDataFrame

,PRODUCT_id,PRODUCT_name,PRODUCT_category,PRODUCT_sub_category,PRODUCT_prod_cost
0,0.0,Hitch Rack - 4-Bike,Accessories,Bike Racks,45.0
596,1.0,All-Purpose Bike Stand,Accessories,Bike Stands,59.0
1048,2.0,Mountain Bottle Cage,Accessories,Bottles and Cages,4.0
1056,3.0,Water Bottle - 30 oz.,Accessories,Bottles and Cages,2.0
1074,4.0,Road Bottle Cage,Accessories,Bottles and Cages,3.0
...,...,...,...,...,...
108780,125.0,"Touring-2000 Blue, 50",Bikes,Touring Bikes,755.0
108864,126.0,"Touring-2000 Blue, 60",Bikes,Touring Bikes,755.0
112074,127.0,"Classic Vest, L",Clothing,Vests,24.0
112080,128.0,"Classic Vest, M",Clothing,Vests,24.0
112090,129.0,"Classic Vest, S",Clothing,Vests,24.0

# Customer

In [4]:
customerDataFrame = salesRepository.getCustomerDataFrame()
customerDataFrame

,CUSTOMER_id,CUSTOMER_country,CUSTOMER_state
0,1088ea3e-cf11-4761-b42c-41c8b7d64d2b,Canada,British Columbia
1,f75c533f-9fdf-43d3-851f-5f0737b3aac8,Canada,British Columbia
2,db8a6f1c-d380-4038-927f-fd00b1dae58e,Australia,New South Wales
3,745f93ca-292b-45a8-947c-0e702a44f5b6,Australia,New South Wales
4,73ac0d5f-0a73-4961-ae83-d63f4b578388,Australia,New South Wales
...,...,...,...
113031,60f5a15d-6248-4c25-a328-0782c1f197a8,United Kingdom,England
113032,0cd8fd4d-1aee-4bd2-9971-2c5e3387345c,Australia,Queensland
113033,71a9b0a7-16a3-45f8-9366-4d1c0cdff231,Australia,Queensland
113034,2db2a9fd-da3e-4fe7-b377-df497e379a40,France,Seine (Paris)
113035,930fcbbd-a955-4bb7-909e-3cfe78dae744,France,Seine (Paris)

# Day

In [5]:
DAY_date = salesRepository.getDayDataFrame()
DAY_date

       DAY_date DAY_MONTH_nr DAY_QUARTER_nr DAY_YEAR_nr
0    2013-11-26           11              4        2013
1    2015-11-26           11              4        2015
2    2014-03-23            3              1        2014
3    2016-03-23            3              1        2016
4    2014-05-15            5              2        2014
...         ...          ...            ...         ...
1879 2011-10-27           10              4        2011
1880 2013-01-06            1              1        2013
1881 2015-01-06            1              1        2015
1882 2012-02-20            2              1        2012
1883 2011-02-20            2              1        2011

[1884 rows x 4 columns]

# Order Detail

In [6]:
orderDetailsData = salesRepository.getOrderDetailsDataFrame()
orderDetailsData

,ORDER_DETAIL_order_quantity,ORDER_DETAIL_unit_price,DAY_date,CUSTOMER_id,PRODUCT_id
0,8,120.0,2013-11-26,1088ea3e-cf11-4761-b42c-41c8b7d64d2b,0.0
1,8,120.0,2015-11-26,f75c533f-9fdf-43d3-851f-5f0737b3aac8,0.0
2,23,120.0,2014-03-23,db8a6f1c-d380-4038-927f-fd00b1dae58e,0.0
3,20,120.0,2016-03-23,745f93ca-292b-45a8-947c-0e702a44f5b6,0.0
4,4,120.0,2014-05-15,73ac0d5f-0a73-4961-ae83-d63f4b578388,0.0
...,...,...,...,...,...
113031,3,64.0,2016-04-12,60f5a15d-6248-4c25-a328-0782c1f197a8,129.0
113032,22,64.0,2014-04-02,0cd8fd4d-1aee-4bd2-9971-2c5e3387345c,128.0
113033,22,64.0,2016-04-02,71a9b0a7-16a3-45f8-9366-4d1c0cdff231,128.0
113034,24,64.0,2014-03-04,2db2a9fd-da3e-4fe7-b377-df497e379a40,127.0
113035,23,64.0,2016-03-04,930fcbbd-a955-4bb7-909e-3cfe78dae744,127.0